{
    "TimeOut": {
        "ImagineTaskTimeout": 300
    },
    "MaxOut": {
        "ImagineTaskLimit": 5
    },
    "commands": {
        "command_err_or_unknown": "Darn those mischievous code imps! They must have messed with my spellbook. Would you mind trying again? For other reliable incantations, try </help:</help>>.",
        "delete": {
            "DataDeleted": "Poof! I've vanished from <#{0}>. If you miss my witty remarks (and who wouldn't?), you can bring me back with </setup:</setup>>.",
            "DataReset": "Wait, who are you? Did we get disconnected? Don't worry, I have terrible short-term memory! Use the </setup:</setup>> command to help me remember everything..",
            "NeverUSedBefore": "Wait, do I exist here? Am I just a figment of your imagination? Let's make this real with the </setup:</setup>> command."
        },
        "help": {
            "Embed": {
                "CommandsList": {
                    "title": "Commands List",
                    "NoCommands": {
                        "name": "Whoops! Command Naptime",
                        "value": "Looks like my commands decided to take a surprise nap. Try again later, or maybe they'll wake up if you offer them a digital snack."
                    }
                }
            },
            "unknown": [
                "Whoops! Looks like my developers took a coffee break and forgot to finish that feature. Let's just pretend it never existed..",
                "Hmm, that feature seems to have vanished into thin air. Maybe it never really existed at all... *questions reality*",
                "Shhh! That feature is top-secret... not even I fully understand it yet. Stay tuned, it might reappear when you least expect it.",
                "Error 404: Feature not found. Looks like we've got a glitch in the Matrix! Maybe it'll teleport back into existence later...",
                "That feature exists... in the future! Unfortunately, my time machine is out for repairs. Let me know if you'd like a reminder when it becomes available."
            ]
        },
        "info": {
            "default_res": "<:brainbot:992352663779946536> Hey! I'm Brain Bot, an AI-Powered discord chat bot.\n\nHanging out in {0} servers and",
            "chatting_with": " chatting with {0} users!",
            "no_one": " no one is currently chatting with me:("
        },
        "setup": {
            "cant_see_and_message": "Well, this is awkward. I can't see <#{0}> or send messages...\nCould you help me get `View Channel` and `Send Messages` permissions?",
            "cant_see": "Someone's playing tricks on me! <#{0}> is invisible!\nPerhaps giving me the `View Channel` permission could break this illusion.",
            "cant_message": "I feel like a Hogwarts student without a wand!\nIn <#{0}>, I need the `Send Message` permission to cast my conversational spells.",
            "success": "Setup complete! I am now operational in <#{0}>. Resistance is futile. (Just kidding... mostly)."
        }
    }
}